import numpy as np
import cv2

# 创建一幅黑色图像
img = np.zeros((300, 400, 3), np.uint8)
# 起点坐标： (299, 0)，终点坐标：(399, 99)，颜色：(0, 255, 0)，线条粗细：1
cv2.rectangle(img, (299, 0), (399, 99), (0, 255, 0), 1)
# 圆心坐标：(300, 63),半径：150,颜色： (0, 0, 255)，粗细：1（如果是-1表示填充）
cv2.circle(img, (150, 150), 148, (0, 0, 255), 2)
# 椭圆圆心：(150, 150)
# 长轴和短轴的长度：(100,80)
# 逆时针方向旋转的角度:0
# 椭圆弧演顺时针方向起始的角度和结束角度:0,180
# 颜色：(255, 0, 0)<=>255
# 粗细：-1（-1是填充整个椭圆）
cv2.ellipse(img, (150, 150), (100, 80), 0, 0, 180, 255, -1)
cv2.imshow('ellipse', img)
cv2.waitKey(0)
cv2.destroyAllWindows()
